
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Kei-14316/aws-ecs-terraform/actions/runs/5220114276)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05bde0a43cedd7f24]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0986b1495eb433f83]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-01c3717c29829d9bf]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07608151bf33406ca]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e1444dc369c6cbad]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e054ec1ea559de12]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02636a6065af32dde]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cfa55090da32ceca]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c0bc41ac623bf047]
aws_security_group.alb: Refreshing state... [id=sg-02656327184f70631]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-046ad7df85107fcee]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0963e4ab147c031f8]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0cd0eae1be65cafc5]
aws_security_group.ecs: Refreshing state... [id=sg-03b9fed5e00715fc7]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-011fa2bf861254f7b]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09af46d018be55f0d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-046ad7df85107fcee1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b00027bee9458ab2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bc3d7f6dd6b2cae4]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c777dfe8108bdfd2]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036b47fbbd9d112a6]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3501366068]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f5ebd36b53770c66]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0bc41aa383cb2c5e6]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0986b1495eb433f831080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c0bc41ac623bf0471080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-02656327184f70631",
        ]
      + subnets                                     = [
          + "subnet-0cfa55090da32ceca",
          + "subnet-0e054ec1ea559de12",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-05bde0a43cedd7f24"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:targetgroup/go-simple-server-target-group/cac4c5a941766467]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Creation complete after 2m14s [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:loadbalancer/app/go-simple-server-alb/5eaad2e6b2138475]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:listener/app/go-simple-server-alb/5eaad2e6b2138475/6aa8f34524ef8443]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:listener-rule/app/go-simple-server-alb/5eaad2e6b2138475/6aa8f34524ef8443/ff5abd0b08871db4]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"fb3f5c3754d197f49a5adc00944de2dc3191f39e","Vars":{},"WorkflowName":"Terraform"} -->